#+TITLE: Emacs
**** org-mode code-template
at the beginning of the line type: <s, push tab, and you should end up with:
#+BEGIN_EXAMPLE
#+BEGIN_SRC 

#+END_SRC
#+END_EXAMPLE
which can be used in the following way to create code segments with syntax highlighting:
#+BEGIN_EXAMPLE
#+BEGIN_SRC C
#include <stdio.h>
int main(){
   printf("hello world\n");
}
#+END_SRC
#+END_EXAMPLE

which looks like this:
#+BEGIN_SRC C
#include <stdio.h>
int main(){
   printf("hello world\n");
}
#+END_SRC

#+RESULTS:
: hello world

*** org-mode code
#+BEGIN_EXAMPLE
#+BEGIN_SRC python
return 1 + 3
#+END_SRC

#+RESULTS:
: 4
#+END_EXAMPLE
#+BEGIN_SRC C
#include <stdio.h>
int main(){
   printf("hello world\n");
}
#+END_SRC

#+RESULTS:
: hello world

or use ':session' to run it as though you're in an interpreter
#+BEGIN_EXAMPLE
#+BEGIN_SRC python :session
1 + 3
#+END_SRC

#+RESULTS:
: 4
#+END_EXAMPLE

